In [4]:
import pandas as pd
import pyodbc

In [5]:
conn = pyodbc.connect(
    "Driver={SQL Server};"
    "Server=SAM\SQLEXPRESS;"  
    "Database=phonepe1;"
    "Trusted_Connection=yes;"
)

# aggregated_insurance
cursor = conn.cursor()

cursor.execute("SELECT * FROM Agg_insu")
table1=cursor.fetchall()


data = [list(row) for row in table1]


agg_insu = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Transacion_type',
                                      'Transacion_count', 'Transacion_amount'])


# aggregated_trancation
cursor = conn.cursor()

cursor.execute("SELECT * FROM Agg_trans")
table2=cursor.fetchall()


data = [list(row) for row in table2]


agg_tran = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Transacion_type',
                                      'Transacion_count', 'Transacion_amount'])



# aggregated_user
cursor = conn.cursor()

cursor.execute("SELECT * FROM Agg_user")
table3=cursor.fetchall()


data = [list(row) for row in table3]


agg_user = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Brands',
                                      'Transacion_count', 'Percentage'])


# map_insurance
cursor = conn.cursor()

cursor.execute("SELECT * FROM map_insu")
table4=cursor.fetchall()


data = [list(row) for row in table4]


map_insu = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Districts',
                                      'Transacion_count', 'Transacion_amount'])


# map_transcation
cursor = conn.cursor()

cursor.execute("SELECT * FROM map_tran")
table5=cursor.fetchall()


data = [list(row) for row in table5]


map_tran = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Districts',
                                      'Transacion_count', 'Transacion_amount'])


# map_user
cursor = conn.cursor()

cursor.execute("SELECT * FROM map_user")
table6=cursor.fetchall()


data = [list(row) for row in table6]


map_user = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Districts',
                                      'RegisteredUserst', 'AppOpens'])


# top_insurance
cursor = conn.cursor()

cursor.execute("SELECT * FROM top_insu")
table7=cursor.fetchall()


data = [list(row) for row in table7]


top_insu = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Pincodes',
                                      'Transacion_count', 'Transacion_amount'])


#top trancation
cursor = conn.cursor()

cursor.execute("SELECT * FROM top_tran")
table8=cursor.fetchall()


data = [list(row) for row in table8]


top_tran = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Pincodes',
                                      'Transacion_count', 'Transacion_amount'])


#top user
cursor = conn.cursor()

cursor.execute("SELECT * FROM top_user")
table9=cursor.fetchall()


data = [list(row) for row in table9]


top_user = pd.DataFrame(data, columns=['State', 'Year', 'Quater', 'Pincodes',
                                      'RegisteredUsers'])

In [6]:
top_user

                  State  Year  Quater  Pincodes  RegisteredUsers
0     Andaman & Nicobar  2018       1    744103             1608
1     Andaman & Nicobar  2018       1    744101             1108
2     Andaman & Nicobar  2018       1    744105             1075
3     Andaman & Nicobar  2018       1    744102             1006
4     Andaman & Nicobar  2018       1    744104              272
...                 ...   ...     ...       ...              ...
9995        West Bengal  2024       4    733134           169596
9996        West Bengal  2024       4    700059           169448
9997        West Bengal  2024       4    711302           146034
9998        West Bengal  2024       4    700150           142151
9999        West Bengal  2024       4    711106           142077

[10000 rows x 5 columns]